#include <stdio.h>
#include <stdlib.h>

/* 7. Напиши програма која преку тастатура ќе овозможува да се внесат три променливи
x, y и z.
Искористи еден израз за дa доделиш нова вредност во променливата “result”, така
што доколку z е помал или еднаков на 25, резултатот ќе биде производот на x и y.
Во спротивно резултатот ќе биде количникот на x и y.
Прикажи го резултатот на екран. (реши ја задачата со помош на тернарен опратор). */

int main()
{
    int x,y,z;

    printf("Vnesi 3 broja: \n");
    scanf("%d", &x);
    scanf("%d", &y);
    scanf("%d", &z);

    int result;

    z <= 25 ? (result = x*y) : (result = (x/y));

    printf("%d", result);
    return 0;
}
